#+TITLE: Pulumi Lab - Infrastructure as Code with Hy
#+AUTHOR: aygp-dr
#+DATE: 2025-08-20
#+STARTUP: overview
#+PROPERTY: header-args :results output :exports both

** Project Structure

#+begin_src bash :results verbatim
tree -L 2 -d .
#+end_src

#+RESULTS:
: pulumi-lab/
: ├── experiments/          # Numbered experiments
: │   ├── 001-github-provider/
: │   ├── 002-github-teams-hy/
: │   ├── 003-aws-ec2-hy/
: │   └── ...
: ├── notes/               # Documentation
: ├── research/            # Pulumi core submodule
: └── scripts/             # Utilities

